# Exercise: Data Merging

Ideally, data analysts would start their work with complete datasets. In practise, however, data often isn't even bundled and has to be aggregated from multiple sources. In this exercise, you will use pandas to merge data from multiple sources in different ways.

In [1]:
# for this exercise, only use pandas
import pandas as pd

##### 1. Read the customer table (customers.csv) and order table (orders.csv) files into two separate dataframes

In [2]:
df_customers = pd.read_csv("customers.csv")
df_orders = pd.read_csv("orders.csv")

##### 2. Create a dataframe, which contains each customer and their associated information from the order table. This new dataframe should keep all entries of the customer.csv table.

In [18]:
df_customers.merge(df_orders, left_on="ID", right_on="Customer")

,ID_x,Name,Street,Phone,ID_y,Item,Amount,Prize,Customer
0,1,Gerry Schaefer,Elizbeth Carroll Street,9624155983,10784,Dillon Crist,2,29.916634,1
1,1,Gerry Schaefer,Elizbeth Carroll Street,9624155983,10804,Jermaine D'Amore,6,93.976604,1
2,2,Lizabeth Armstrong,Art Kirlin Street,6174621765,11005,Gennie Ferry,8,62.931166,2
3,7,Ermelinda Beer,Argelia Bergnaum Avenue,1946574623,10745,Orville Dooley,5,91.224854,7
4,8,Thersa Frami,Asley Simonis Avenue,5369876185,11018,Luther Frami,5,57.447208,8
...,...,...,...,...,...,...,...,...,...
297,496,Millard Haley,Layla Baumbach Street,7949182837,10927,Millard Bogan,6,21.425473,496
298,497,Starr Padberg,Kurtis Tillman Road,7184878479,10795,Frederic West,2,46.933680,497
299,498,Dee Kris,Dagmar Russel Road,1969268621,10736,Margie Gibson,4,89.046203,498
300,498,Dee Kris,Dagmar Russel Road,1969268621,10889,Sean Schoen,2,94.044920,498
301,499,Hai Krajcik,Chase Wiegand Road,2538568974,10840,Torri Aimonetti,1,44.787527,499

In [19]:
df_customers.merge(df_orders, left_on="ID", right_on="Customer", how="left")

,ID_x,Name,Street,Phone,ID_y,Item,Amount,Prize,Customer
0,1,Gerry Schaefer,Elizbeth Carroll Street,9624155983,10784.0,Dillon Crist,2.0,29.916634,1.0
1,1,Gerry Schaefer,Elizbeth Carroll Street,9624155983,10804.0,Jermaine D'Amore,6.0,93.976604,1.0
2,2,Lizabeth Armstrong,Art Kirlin Street,6174621765,11005.0,Gennie Ferry,8.0,62.931166,2.0
3,3,Ming Veum,Eusebio Pagac Street,6845739684,NaN,NaN,NaN,NaN,NaN
4,4,Marcelino Larson,Jules Gutkowski Road,1594525216,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
588,497,Starr Padberg,Kurtis Tillman Road,7184878479,10795.0,Frederic West,2.0,46.933680,497.0
589,498,Dee Kris,Dagmar Russel Road,1969268621,10736.0,Margie Gibson,4.0,89.046203,498.0
590,498,Dee Kris,Dagmar Russel Road,1969268621,10889.0,Sean Schoen,2.0,94.044920,498.0
591,499,Hai Krajcik,Chase Wiegand Road,2538568974,10840.0,Torri Aimonetti,1.0,44.787527,499.0
592,500,Shameka Hane,Ruby Ernser Avenue,9688141573,NaN,NaN,NaN,NaN,NaN

In [4]:
df_customers.head()

   ID                Name                     Street       Phone
0   1      Gerry Schaefer  Elizbeth Carroll Street    9624155983
1   2  Lizabeth Armstrong        Art Kirlin Street    6174621765
2   3           Ming Veum     Eusebio Pagac Street    6845739684
3   4    Marcelino Larson     Jules Gutkowski Road    1594525216
4   5        Brooke Ortiz      Monte Predovic Road    7618645478

In [5]:
df_orders.head()

      ID                Item  Amount      Prize  Customer
0  10735     Lorenzo Hagenes       3  20.798804       399
1  10736       Margie Gibson       4  89.046203       498
2  10737    Melodie Dietrich       5  19.707403        26
3  10738           Dora Lowe       5  32.199187       523
4  10739  Martina Hodkiewicz      10  94.048839       553

##### 3. Create a dataframe, which contains only customers that already have placed at least one order

##### 4. Create a dataframe, that merges and keeps _all_ entries from both datasets

##### 5. Create a dataframe that contains all customers that have _not_ placed an order yet